{"template":"yodi","name":"Soeltan Zaki Rizaldy","photo":"","title":"Senior Software Engineer","phone":"081282870150","birthdate":"1990-01-15","cityOfBirth":"Bekasi","location":"K.H.Dewantara no.42 RT/RW 005/005 Pilar Barat III, Karang Asih, Cikarang Utara, 17530","website":"","email":"zcky1990@gmail.com","linkedin":"https://www.linkedin.com/in/soeltan-zaki-rizaldy-99b682a6","github":"github.com/zcky1990","dribbble":"","instagram":"","about":"I am Soeltan Zaki Rizaldy, a dedicated Senior Software Engineer II and Associate Principal Architect with over 10 years of experience in full-stack development, architectural migration, and system optimization. During my extensive career, particularly at Alodokter, I led crucial projects, including the migration of our core architecture to Kubernetes to significantly enhance scalability and reliability. My current focus at Photon Interactive Indonesia involves researching and integrating complex systems like Hubspot CMS and migrating platforms, such as moving content management to Builder.io for improved efficiency and visual editing. I thrive on implementing robust backend solutions using Ruby on Rails and Java (Spring Boot), combined with modern front-end technologies like Vue.js and Lit-Element.","hobbies":"","education":[{"university":"Gunadarma University","city":"Jakarta, Indonesia","degree":"Master's Degree, Information Systems Software","gpa":"","dateStart":"","dateEnd":"","date":"Present","thesis":""},{"university":"Gunadarma University","city":"Jakarta, Indonesia","degree":"Bachelor Degree, Informatics Engineering","gpa":"","dateStart":"","dateEnd":"","date":"Present","thesis":""}],"experience":[{"company":"Photon Interactive Indonesia","city":"Jakarta, Indonesia","position":"Senior Software Engineer II","dateStart":"2025-07-21","dateEnd":"","date":"July 2025 - Present","description":"phtn.ai — Identified and analyzed key HubSpot CMS and Marketing Hub capabilities for high-tech website implementation, including custom modules and CRM integration (Tech stack: HubSpot).\n\nthorne.com — Migrated content management from an internal CMS to Builder.io, improving workflow efficiency, enabling visual editing, and enhancing digital experience scalability (Tech stack: Node.js)."},{"company":"Mekari","city":"Jakarta, Indonesia","position":"Software Engineer II","dateStart":"2024-04-01","dateEnd":"2024-12-20","date":"April 2024 - December 2024","description":"Maintained Mekari Account and Launchpad systems; analyzed system procedures, dependency management, and testing strategies for Ruby on Rails upgrades; implemented the Policy Content Service used across all Mekari products; and contributed to frontend and API development using Ruby on Rails, PostgreSQL, n8n, and Vue.js."},{"company":"Alodokter","city":"Jakarta, Indonesia","position":"Associate Principal Architect Fullstack","dateStart":"2022-11-30","dateEnd":"2024-01-31","date":"November 2022 - January 2024","description":"Oversaw and researched system components for seamless integration into the Alodokter ecosystem, led the migration to Kubernetes to enhance scalability and reliability, conducted integration strategy research to mitigate architectural risks, and collaborated with cross-functional teams to ensure technical and business alignment using technologies such as Ruby on Rails, Polymer/LitElement, MongoDB, Elasticsearch, Redis, Google Pub/Sub, Docker, and Kubernetes."},{"company":"Alodokter","city":"Jakarta, Indonesia","position":"Senior Fullstack Developer","dateStart":"2022-09-30","dateEnd":"2022-11-30","date":"September 2022 - November 2022","description":"Collaborated with cross-functional teams to develop, maintain, and optimize key Alodokter application features, including building and deploying web applications, implementing new platform functionalities, integrating third-party APIs, creating versioned REST APIs, and contributing to the Insurance Workflow feature, using Ruby on Rails, PolymerLit Element, MongoDB, Elasticsearch, Redis, and Google PubSub."},{"company":"Alodokter","city":"Jakarta, Indonesia","position":"Fullstack Developer","dateStart":"2019-03-01","dateEnd":"2022-09-30","date":"March 2019 - September 2022","description":"Collaborated with team to develop, maintain, and optimize Alodokter application features, including developing and deploying web applications, implementing and maintaining features, integrating multiple third-party APIs into the core platform, and creating/maintaining versioned REST APIs using Ruby on Rails, Polymer, MongoDB, Elasticsearch, and Redis."},{"company":"Photon Interactive Indonesia","city":"Jakarta, Indonesia","position":"Software Engineer","dateStart":"2015-09-01","dateEnd":"2019-01-15","date":"September 2015 - January 2019","description":"Developed a Project Progress Monitoring Application for reporting progress, tracking bugs, managing tasks, planning team activities, implementing a visually intuitive dashboard, tracking daily team progress, and calculating project costs using Spring Boot, JavaScript Photon Framework, SQL Server, and MongoDB."}],"volunteer":[],"publications":"[1] Zaki, R. (2013, June 15). Prototipe Aplikasi Ensiklopedia Indonesia Berbasis iOS. Seminar Nasional Aplikasi Teknologi Informasi (SNATI), ISSN 1907-5022.\n[2] Zaki, R. (2012, November 14). Perancangan sistem informasi alat travel guide walk around the world. Seminar Nasional dan Expo Teknik Elektro, ISSN 2088-9984.","skills":"Programing Language : Java, Ruby On Rails, Javascript, HTML, CSS\nDatabase : Mysql, PostgreSql, Mongodb, Redis\nTools : git, Docker, Kubernetes, GCP\n","languages":[{"name":"Indonesia","level":"Native"},{"name":"English","level":"Written"}],"projects":[{"title":"Javanese Script Character Recognition Using Artificial Neural Networks","tech":"Java, December - 2014","description":"Javanese script recognition application using ANN and Java"},{"title":" Aplikasi Pemilu PELITA","tech":"Android, November -2015","description":"Application developed to participate in the Code for Vote 4.0 competition by Google"},{"title":"Aplikasi Peringkas Text Otomatis berbasis Android","tech":"Android, 2014","description":"The application was developed as a final assignment for a thesis. The application uses Tesseract as the main library to perform OCR and uses the TF-IDF algorithm to summarize text."}],"awards":"4th winner google code for vote 4.0....2015","margin":[6,4,6,4],"paperSize":"letter","orientation":"portrait"}
